Tekla Open API Reference for Tekla Structures 2025
Angle Class
 Provides support for angles using either the current Tekla Structures units, or user defined units
Inheritance Hierarchy
System.Object
 Tekla.Structures.Datatype.Angle
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Angle : IFormattable, IComparable<Angle>,
	IEquatable<Angle>
Public Class Angle
	Implements IFormattable, IComparable(Of Angle),
	IEquatable(Of Angle)
The Angle type exposes the following members.
Properties
Name | Description
CurrentUnitType
 Gets or sets the Tekla Structures current angle type
CurrentUnitValue
 Gets the value of the angle in the current unit
DecimalPlaces
 Gets the number of decimal places used for angles.
Degrees
 Gets the angle value in degrees
Radians
 Gets the angle value in radians
Top
Methods
Name | Description
CompareTo
 Compares this angle with another angle
Equals
 Checks for approximate angle equality
FromCurrentUnit
 Creates an angle given in the current unit type
FromDegrees
 Creates an angle from a value in degrees
FromRadians
 Creates an angle from a value in radians
Parse(String)
 Parses the given text as an angle in the current unit type
Parse(String, IFormatProvider)
 Parses the given text as an angle in the current unit type
Parse(String, IFormatProvider, Angle.UnitType)
 Parses the given text as an angle in the current unit type
ToString()
 Converts the represented angle to a string in the current units
 (Overrides Object.ToString().)
ToString(Angle.UnitType)
 Converts the represented angle to a string in the given units
ToString(String, IFormatProvider)
 Converts the represented angle to a string with the given parameters
ToString(String, IFormatProvider, Angle.UnitType)
 Converts the represented angle to a string with the given parameters
TryParse(String, Angle)
 Parses the given text as an angle in the current unit type
TryParse(String, IFormatProvider, Angle)
 Parses the given text as an angle in the current unit type
TryParse(String, IFormatProvider, Angle.UnitType, Angle)
 Parses the given text as an angle in the current unit type
Top
See Also
Reference
Tekla.Structures.Datatype Namespace